In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("universidad.csv")

In [3]:
df.head()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [4]:
#Muestra las primeras 5 filas
df.head()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [5]:
#muestra las 3 primeras filas
df.head(3)

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX

In [6]:
#Muestra la primera fila
df.head(1)

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX

In [7]:
#Muestra las ultimas 5 filas
df.tail()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
5,6,Miguel Torres,20,2004-09-12,Medicina,4,9.0,CDMX
6,7,Daniela Cruz,22,2002-02-18,Derecho,6,8.1,Guadalajara
7,8,Pedro Sanchez,24,2000-12-01,Ingenieria,8,7.5,Monterrey
8,9,Valeria Ortiz,21,2003-06-25,Arquitectura,5,8.9,CDMX
9,10,Jorge Ramos,19,2005-08-14,Ingenieria,2,8.0,Puebla

In [8]:
df.head(-5)

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [9]:
#guarda el dataframe en una variable nueva llamada datos
datos = df

In [10]:
datos.head()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [11]:
#consulta los tipos de datos
datos.dtypes

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [12]:
tipos_datos = datos.dtypes

In [13]:
tipos_datos

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [14]:
#IMPRIME los tipos de datos
print(tipos_datos)

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [15]:
#identifica columnas numericas
df.select_dtypes(include="number").columns

Index(['id_alumno', 'edad', 'semestre', 'promedio'], dtype='object')

In [16]:
df.head()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [18]:
df.dtypes

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [19]:
tipos_datos

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [20]:
#IDENTIFICA COLUMNAS DE TEXTO
datos.select_dtypes(include="object")

           nombre fecha_nacimiento       carrera       ciudad
0       Ana Lopez       2004-03-15    Ingenieria         CDMX
1     Carlos Ruiz       2002-07-10      Medicina  Guadalajara
2  Sofia Martinez       2005-01-22       Derecho         CDMX
3      Juan Perez       2003-11-05    Ingenieria    Monterrey
4     Laura Gomez       2001-05-30  Arquitectura       Puebla
5   Miguel Torres       2004-09-12      Medicina         CDMX
6    Daniela Cruz       2002-02-18       Derecho  Guadalajara
7   Pedro Sanchez       2000-12-01    Ingenieria    Monterrey
8   Valeria Ortiz       2003-06-25  Arquitectura         CDMX
9     Jorge Ramos       2005-08-14    Ingenieria       Puebla

In [21]:
datos.select_dtypes(include="object").columns

Index(['nombre', 'fecha_nacimiento', 'carrera', 'ciudad'], dtype='object')

In [22]:
datos.head(1)

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX

In [23]:
datos.dtypes

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [24]:
df['promedio'].dtypes

dtype('float64')

In [25]:
df["promedio"].dtypes

dtype('float64')

In [26]:
#tipo de dato de promedio
df["promedio"].dtypes

dtype('float64')

In [27]:
df.dtypes["fecha_nacimiento"]

dtype('O')

In [28]:
datos.dtypes["promedio"]

dtype('float64')

In [29]:
datos.dtypes["fecha_nacimiento"]

dtype('O')

In [30]:
#tipo de dato fecha de nacimiento
datos["fecha_nacimiento"].dtypes

dtype('O')

In [31]:
df["fecha_nacimiento"].dtype

dtype('O')

In [32]:
tipos_datos

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [33]:
#cuenta cuantas columnas hay
len(datos.columns)

8

In [34]:
datos

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla
5,6,Miguel Torres,20,2004-09-12,Medicina,4,9.0,CDMX
6,7,Daniela Cruz,22,2002-02-18,Derecho,6,8.1,Guadalajara
7,8,Pedro Sanchez,24,2000-12-01,Ingenieria,8,7.5,Monterrey
8,9,Valeria Ortiz,21,2003-06-25,Arquitectura,5,8.9,CDMX
9,10,Jorge Ramos,19,2005-08-14,Ingenieria,2,8.0,Puebla

In [35]:
#lista de nombres
lista_nombres = datos["nombre"]

In [36]:
lista_nombres

0         Ana Lopez
1       Carlos Ruiz
2    Sofia Martinez
3        Juan Perez
4       Laura Gomez
5     Miguel Torres
6      Daniela Cruz
7     Pedro Sanchez
8     Valeria Ortiz
9       Jorge Ramos
Name: nombre, dtype: object

In [37]:
lista_nombres = datos["nombre"].tolist()

In [38]:
lista_nombres

['Ana Lopez',
 'Carlos Ruiz',
 'Sofia Martinez',
 'Juan Perez',
 'Laura Gomez',
 'Miguel Torres',
 'Daniela Cruz',
 'Pedro Sanchez',
 'Valeria Ortiz',
 'Jorge Ramos']

In [40]:
tipos_datos

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [41]:
datos

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla
5,6,Miguel Torres,20,2004-09-12,Medicina,4,9.0,CDMX
6,7,Daniela Cruz,22,2002-02-18,Derecho,6,8.1,Guadalajara
7,8,Pedro Sanchez,24,2000-12-01,Ingenieria,8,7.5,Monterrey
8,9,Valeria Ortiz,21,2003-06-25,Arquitectura,5,8.9,CDMX
9,10,Jorge Ramos,19,2005-08-14,Ingenieria,2,8.0,Puebla

In [42]:
datos["carrera"].tolist()

['Ingenieria',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Ingenieria']

In [44]:
datos.dtypes

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [45]:
lista_carreras = datos["carrera"].tolist()

In [46]:
lista_carreras

['Ingenieria',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Ingenieria']

In [47]:
tipos_datos

id_alumno             int64
nombre               object
edad                  int64
fecha_nacimiento     object
carrera              object
semestre              int64
promedio            float64
ciudad               object
dtype: object

In [48]:
lista_promedios = datos["promedio"].tolist()

In [49]:
lista_promedios

[8.7, 9.1, 8.3, 7.9, 8.8, 9.0, 8.1, 7.5, 8.9, 8.0]

In [51]:
lista_edades = datos["edad"].tolist()

In [52]:
lista_edades

[20, 22, 19, 21, 23, 20, 22, 24, 21, 19]

In [54]:
lista_nombres

['Ana Lopez',
 'Carlos Ruiz',
 'Sofia Martinez',
 'Juan Perez',
 'Laura Gomez',
 'Miguel Torres',
 'Daniela Cruz',
 'Pedro Sanchez',
 'Valeria Ortiz',
 'Jorge Ramos']

In [55]:
lista_nombres[0]

'Ana Lopez'

In [56]:
#ultimo nombre
lista_nombres[-1]

'Jorge Ramos'

In [57]:
min(lista_promedios)

7.5

In [59]:
lista_carreras

['Ingenieria',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Ingenieria']

In [60]:
len(datos["carrera"].tolist())

10

In [62]:
len(lista_carreras)

10

In [63]:
lista_edades[:3]

[20, 22, 19]

In [66]:
df["edad"].tolist()

[20, 22, 19, 21, 23, 20, 22, 24, 21, 19]

In [67]:
datos["edad"].tolist()[:3]

[20, 22, 19]

In [68]:
lista_edades[:3]

[20, 22, 19]

In [70]:
df.head()

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla

In [72]:
df.columns

Index(['id_alumno', 'nombre', 'edad', 'fecha_nacimiento', 'carrera',
       'semestre', 'promedio', 'ciudad'],
      dtype='object')

In [73]:
lista_ciudades = datos["ciudad"].tolist()

In [75]:
lista_ciudades

['CDMX',
 'Guadalajara',
 'CDMX',
 'Monterrey',
 'Puebla',
 'CDMX',
 'Guadalajara',
 'Monterrey',
 'CDMX',
 'Puebla']

In [76]:
aprobacion = {"promedio_aprobatorio":7}

In [77]:
aprobacion

{'promedio_aprobatorio': 7}

In [80]:
#diccionario total de alumnos
total_alumnos = {"Total": len(df)}

In [82]:
len(df)

10

In [83]:
datos

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla
5,6,Miguel Torres,20,2004-09-12,Medicina,4,9.0,CDMX
6,7,Daniela Cruz,22,2002-02-18,Derecho,6,8.1,Guadalajara
7,8,Pedro Sanchez,24,2000-12-01,Ingenieria,8,7.5,Monterrey
8,9,Valeria Ortiz,21,2003-06-25,Arquitectura,5,8.9,CDMX
9,10,Jorge Ramos,19,2005-08-14,Ingenieria,2,8.0,Puebla

In [84]:
#diccionario carreras
dic_carreras = {"total carreras": datos["carrera"].unique().tolist()}

In [85]:
dic_carreras

{'total carreras': ['Ingenieria', 'Medicina', 'Derecho', 'Arquitectura']}

In [86]:
datos["carrera"].tolist()

['Ingenieria',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Medicina',
 'Derecho',
 'Ingenieria',
 'Arquitectura',
 'Ingenieria']

In [88]:
datos["carrera"].unique()

array(['Ingenieria', 'Medicina', 'Derecho', 'Arquitectura'], dtype=object)

In [89]:
datos["carrera"].unique().tolist()

['Ingenieria', 'Medicina', 'Derecho', 'Arquitectura']

In [90]:
dic_carreras

{'total carreras': ['Ingenieria', 'Medicina', 'Derecho', 'Arquitectura']}

In [92]:
lista_ciudades

['CDMX',
 'Guadalajara',
 'CDMX',
 'Monterrey',
 'Puebla',
 'CDMX',
 'Guadalajara',
 'Monterrey',
 'CDMX',
 'Puebla']

In [94]:
lista_ciudades

['CDMX',
 'Guadalajara',
 'CDMX',
 'Monterrey',
 'Puebla',
 'CDMX',
 'Guadalajara',
 'Monterrey',
 'CDMX',
 'Puebla']

In [96]:
datos["ciudad"]

0           CDMX
1    Guadalajara
2           CDMX
3      Monterrey
4         Puebla
5           CDMX
6    Guadalajara
7      Monterrey
8           CDMX
9         Puebla
Name: ciudad, dtype: object

In [97]:
datos["ciudad"].unique()

array(['CDMX', 'Guadalajara', 'Monterrey', 'Puebla'], dtype=object)

In [98]:
datos["ciudad"].unique().tolist()

['CDMX', 'Guadalajara', 'Monterrey', 'Puebla']

In [99]:
lista_ciudades

['CDMX',
 'Guadalajara',
 'CDMX',
 'Monterrey',
 'Puebla',
 'CDMX',
 'Guadalajara',
 'Monterrey',
 'CDMX',
 'Puebla']

In [101]:
dic_ciudades = {"total ciudades": datos["ciudad"].unique().tolist()}

In [102]:
dic_ciudades

{'total ciudades': ['CDMX', 'Guadalajara', 'Monterrey', 'Puebla']}

In [103]:
df["promedio"].min()

np.float64(7.5)

In [104]:
dic_promedio_min = {"minimo": datos["promedio"].min()}

In [105]:
dic_promedio_min

{'minimo': np.float64(7.5)}

In [106]:
dic_promedio_min["minimo"]

np.float64(7.5)

In [107]:
#alumnos por carrera
datos["carrera"].value_counts()

carrera
Ingenieria      4
Medicina        2
Derecho         2
Arquitectura    2
Name: count, dtype: int64

In [108]:
datos["carrera"].value_counts("Medicina")

carrera
Ingenieria      0.4
Medicina        0.2
Derecho         0.2
Arquitectura    0.2
Name: proportion, dtype: float64

In [110]:
#alumnos por ciudad
datos["ciudad"].value_counts()

ciudad
CDMX           4
Guadalajara    2
Monterrey      2
Puebla         2
Name: count, dtype: int64

In [111]:
df.head(9)

,id_alumno,nombre,edad,fecha_nacimiento,carrera,semestre,promedio,ciudad
0,1,Ana Lopez,20,2004-03-15,Ingenieria,4,8.7,CDMX
1,2,Carlos Ruiz,22,2002-07-10,Medicina,6,9.1,Guadalajara
2,3,Sofia Martinez,19,2005-01-22,Derecho,2,8.3,CDMX
3,4,Juan Perez,21,2003-11-05,Ingenieria,5,7.9,Monterrey
4,5,Laura Gomez,23,2001-05-30,Arquitectura,7,8.8,Puebla
5,6,Miguel Torres,20,2004-09-12,Medicina,4,9.0,CDMX
6,7,Daniela Cruz,22,2002-02-18,Derecho,6,8.1,Guadalajara
7,8,Pedro Sanchez,24,2000-12-01,Ingenieria,8,7.5,Monterrey
8,9,Valeria Ortiz,21,2003-06-25,Arquitectura,5,8.9,CDMX

In [113]:
df["semestre"].value_counts()

semestre
4    2
6    2
2    2
5    2
7    1
8    1
Name: count, dtype: int64

In [114]:
#carreras ordenadas
datos["carrera"].value_counts()

carrera
Ingenieria      4
Medicina        2
Derecho         2
Arquitectura    2
Name: count, dtype: int64

In [115]:
datos["carrera"].value_counts().sort_values(ascending=True)

carrera
Medicina        2
Derecho         2
Arquitectura    2
Ingenieria      4
Name: count, dtype: int64

In [116]:
datos["carrera"].sort_values(ascending=True)

4    Arquitectura
8    Arquitectura
2         Derecho
6         Derecho
0      Ingenieria
3      Ingenieria
7      Ingenieria
9      Ingenieria
1        Medicina
5        Medicina
Name: carrera, dtype: object

In [117]:
#porcentaje por carrera
datos["carrera"].value_counts(normalize=True)

carrera
Ingenieria      0.4
Medicina        0.2
Derecho         0.2
Arquitectura    0.2
Name: proportion, dtype: float64

In [118]:
datos["carrera"].value_counts(normalize=True) * 100

carrera
Ingenieria      40.0
Medicina        20.0
Derecho         20.0
Arquitectura    20.0
Name: proportion, dtype: float64